tap "avencera/taps"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "planetscale/tap"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Mozilla CA certificate store
brew "ca-certificates"
# Software library to render fonts
brew "freetype"
# Multi-platform, multi-architecture disassembly framework
brew "capstone"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Text-based UI library
brew "ncurses"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Extremely Fast Compression algorithm
brew "lz4"
# Zstandard is a real-time compression algorithm
brew "zstd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Multi-platform library for OpenGL applications
brew "glfw"
# GNU grep, egrep and fgrep
brew "grep"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# GUI toolkit
brew "gtk+"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# DNS library written in C
brew "ldns"
# CBOR protocol implementation for C and others
brew "libcbor"
# Asynchronous event library
brew "libevent"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Python 2 and 3 compatibility utilities
brew "six"
# High-performance theorem prover
brew "z3"
# Next-gen compiler infrastructure
brew "llvm"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Bare libuv bindings for lua
brew "luv"
# Macro processing language
brew "m4"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Open source relational database management system
brew "mysql-client"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Internet file retriever
brew "wget"
# CLI for organizing Tailwind CSS classes
brew "avencera/taps/rustywind"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# The PlanetScale CLI
brew "planetscale/tap/pscale"
# Application launcher and productivity software
cask "alfred"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox-developer-edition"
# Git client focusing on productivity
cask "gitkraken"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source code editor
cask "visual-studio-code"
